package homeworks.extraHomework;

public class WorkWithString {
    public static void main(String[] args) {

        //Тема: создание переменной типа String.
        //
        //Напишите программу в которой создайте переменную
        //типа String и присвойте ей в качестве начального значения
        //ваше имя. Выведете на консоль значение этой переменной.

        String myName  = "Alina";
        System.out.println(myName);

        //Напишите программу в которой создайте переменную
        //типа String и присвойте ей в качестве начального значения
        //ваше имя. Выведете на консоль приветствие типа "Hi YourName".

        System.out.println("Hi " + myName + " !");





    }
}
