package homeworks.extraHomework.addHomework2.task1;

public class Robot {

    //Создайте в классе Robot метод со следующей сигнатурой:
    public void sayHello(){
        //тут напишите команду распечатки на консоли строки "Hello!"
        System.out.println("Hello!");
    }

    //В классе робот (Robot) создайте конструктор без параметров:

    public Robot() {

    }
    //Создайте в классе Robot метод со следующей сигнатурой:

    public void sayYourName(){
        System.out.println("My name is ROBO");
    }

    public void sayYourName3(){
        System.out.println("My name is Bobo");
    }


}
