package homeworks.homework04;

//Объявите 10 переменных типа int со значениями 0, 1, 2, 3, 4, 5, 6, 7, 8, 9.
//Объявите ещё одну переменную int и сохраните в неё сумму этих переменных, деленную на 10.
//Получается, у вас будет среднее арифметическое этих чисел в одной переменной.
//Распечатайте её через println. Сколько программа отбросила в дробной части?

public class Task2 {
    int a;
    int b;
    int c;
    int d;
    int e;
    int f;
    int g;
    int h;
    int i;
    int j;
    int sum;

}
